Repository: alejandroriverovaldescaro/documentvalidation
Catalog: DocumentValidationApp/Resources/SharedResource.*.resx
Languages: es, nl

# Nav.Home
source: Home
es: Inicio

# Nav.DocumentValidation
source: Document Validation
es: Validación de Documentos
nl: Documentvalidatie

# Nav.AppName
source: Document Validation
es: Validación de Documentos
nl: Documentvalidatie

# Home.Title
source: Document Validation System
es: Sistema de Validación de Documentos
nl: Documentvalidatiesysteem

# Home.Subtitle
source: Validate and extract information from identity documents using AI-powered document analysis
es: Valide y extraiga información de documentos de identidad utilizando análisis de documentos impulsado por IA
nl: Valideer en extraheer informatie uit identiteitsdocumenten met AI-aangedreven documentanalyse

# Home.Description
source: Upload your documents (PDF or images) and get instant feedback about document type, expiration dates, and other critical information.
es: Cargue sus documentos (PDF o imágenes) y obtenga comentarios instantáneos sobre el tipo de documento, fechas de vencimiento y otra información crítica.
nl: Upload uw documenten (PDF of afbeeldingen) en krijg directe feedback over documenttype, vervaldatums en andere cruciale informatie.

# Home.UploadButton
source: Upload Document
es: Cargar Documento
nl: Document uploaden

# Home.PDFSupport
source: PDF Support
es: Soporte PDF
nl: PDF-ondersteuning

# Home.PDFDescription
source: Extract text and metadata from PDF documents automatically.
es: Extraiga texto y metadatos de documentos PDF automáticamente.
nl: Extraheer automatisch tekst en metadata uit PDF-documenten.

# Home.ImageProcessing
source: Image Processing
es: Procesamiento de Imágenes
nl: Beeldverwerking

# Home.ImageDescription
source: Process document images in PNG, JPG, and JPEG formats with OCR support.
es: Procese imágenes de documentos en formatos PNG, JPG y JPEG con soporte OCR.
nl: Verwerk documentafbeeldingen in PNG-, JPG- en JPEG-formaten met OCR-ondersteuning.

# Home.SmartDetection
source: Smart Detection
es: Detección Inteligente
nl: Slimme detectie

# Home.SmartDescription
source: Automatically identify document types: Passport, Driver's License, ID Card.
es: Identifique automáticamente tipos de documentos: Pasaporte, Licencia de Conducir, Tarjeta de Identidad.
nl: Identificeer automatisch documenttypen: Paspoort, Rijbewijs, Identiteitskaart.

# Home.SupportedDocuments
source: Supported Document Types
es: Tipos de Documentos Soportados
nl: Ondersteunde documenttypen

# Home.Passports
source: Passports
es: Pasaportes
nl: Paspoorten

# Home.PassportsDesc
source: International travel documents
es: Documentos de viaje internacionales
nl: Internationale reisdocumenten

# Home.DriversLicense
source: Driver's Licenses
es: Licencias de Conducir
nl: Rijbewijzen

# Home.DriversLicenseDesc
source: State-issued driving permits
es: Permisos de conducir emitidos por el estado
nl: Door de staat afgegeven rijvergunningen

# Home.IdentityCards
source: Identity Cards
es: Tarjetas de Identidad
nl: Identiteitskaarten

# Home.IdentityCardsDesc
source: National ID cards
es: Tarjetas de identificación nacionales
nl: Nationale identiteitskaarten

# Home.OtherDocuments
source: Other Documents
es: Otros Documentos
nl: Andere documenten

# Home.OtherDocumentsDesc
source: General document validation
es: Validación general de documentos
nl: Algemene documentvalidatie

# Home.ExtractedData
source: Extracted Data:
es: Datos Extraídos:
nl: Geëxtraheerde gegevens:

# Home.ExpirationDates
source: Expiration dates
es: Fechas de vencimiento
nl: Vervaldatums

# Home.DocumentNumbers
source: Document numbers
es: Números de documento
nl: Documentnummers

# Home.IssuingAuthorities
source: Issuing authorities
es: Autoridades emisoras
nl: Uitgevende autoriteiten

# DocVal.PageTitle
source: Document Validation
es: Validación de Documentos
nl: Documentvalidatie

# DocVal.CardHeader
source: Upload Document for Validation
es: Cargar Documento para Validación
nl: Document uploaden voor validatie

# DocVal.CardDescription
source: Upload a document (PDF, PNG, JPG, JPEG) to validate its type and extract key information. Supported documents: Passport, Driver's License, ID Card.
es: Cargue un documento (PDF, PNG, JPG, JPEG) para validar su tipo y extraer información clave. Documentos soportados: Pasaporte, Licencia de Conducir, Tarjeta de Identidad.
nl: Upload een document (PDF, PNG, JPG, JPEG) om het type te valideren en belangrijke informatie te extraheren. Ondersteunde documenten: Paspoort, Rijbewijs, Identiteitskaart.

# DocVal.ProcessingMethod
source: Processing Method
es: Método de Procesamiento
nl: Verwerkingsmethode

# DocVal.TesseractOCR
source: Tesseract OCR (Traditional text extraction)
es: Tesseract OCR (Extracción de texto tradicional)
nl: Tesseract OCR (Traditionele tekstextractie)

# DocVal.OllamaVision
source: Ollama AI Vision (Qwen3-VL - Advanced image analysis)
es: Ollama AI Vision (Qwen3-VL - Análisis de imagen avanzado)
nl: Ollama AI Vision (Qwen3-VL - Geavanceerde beeldanalyse)

# DocVal.TesseractDescription
source: Traditional OCR for text extraction from document images.
es: OCR tradicional para extracción de texto de imágenes de documentos.
nl: Traditionele OCR voor tekstextractie uit documentafbeeldingen.

# DocVal.AzureAIVision
source: Azure AI Vision (Cloud-based advanced analysis)
es: Azure AI Vision (Análisis avanzado basado en la nube)
nl: Azure AI Vision (Cloud-gebaseerde geavanceerde analyse)

# DocVal.AzureAIVisionDescription
source: Cloud-based AI vision service with comprehensive image analysis, OCR, and object detection.
es: Servicio de visión AI basado en la nube con análisis de imagen, OCR y detección de objetos.
nl: Cloud-gebaseerde AI-visiedienst met uitgebreide beeldanalyse, OCR en objectdetectie.

# DocVal.AzureAIVisionDesc
source: Microsoft Azure cloud AI for advanced document analysis
es: IA en la nube de Microsoft Azure para análisis avanzado de documentos
nl: Microsoft Azure cloud AI voor geavanceerde documentanalyse

# DocVal.SelectDocument
source: Select Document
es: Seleccionar Documento
nl: Document selecteren

# DocVal.AcceptedFormats
source: Accepted formats: PDF, PNG, JPG, JPEG (Max size: 10MB)
es: Formatos aceptados: PDF, PNG, JPG, JPEG (Tamaño máx: 10MB)
nl: Geaccepteerde formaten: PDF, PNG, JPG, JPEG (Max grootte: 10MB)

# DocVal.Processing
source: Processing document with {0}... Please wait.
es: Procesando documento con {0}... Por favor espere.
nl: Document verwerken met {0}... Even geduld.

# DocVal.HowItWorks
source: How it works
es: Cómo funciona
nl: Hoe het werkt

# DocVal.Step1
source: Select processing method
es: Seleccione el método de procesamiento
nl: Selecteer verwerkingsmethode

# DocVal.Step2
source: Upload your document
es: Cargue su documento
nl: Upload uw document

# DocVal.Step3
source: The system analyzes the file
es: El sistema analiza el archivo
nl: Het systeem analyseert het bestand

# DocVal.Step4
source: Document type is identified
es: Se identifica el tipo de documento
nl: Documenttype wordt geïdentificeerd

# DocVal.Step5
source: Key data is extracted (dates, numbers)
es: Se extraen los datos clave (fechas, números)
nl: Belangrijke gegevens worden geëxtraheerd (datums, nummers)

# DocVal.Step6
source: Validation results are displayed
es: Se muestran los resultados de validación
nl: Validatieresultaten worden weergegeven

# DocVal.ProcessingMethods
source: Processing Methods
es: Métodos de Procesamiento
nl: Verwerkingsmethoden

# DocVal.TesseractOCRDesc
source: Fast, reliable text extraction
es: Extracción de texto rápida y confiable
nl: Snelle, betrouwbare tekstextractie

# DocVal.OllamaVisionDesc
source: Advanced AI analysis with better context understanding
es: Análisis de IA avanzado con mejor comprensión del contexto
nl: Geavanceerde AI-analyse met beter contextbegrip

# DocVal.Privacy
source: Privacy
es: Privacidad

# DocVal.PrivacyDesc
source: Documents are processed in memory and not stored on the server. Ollama runs locally on your machine.
es: Los documentos se procesan en memoria y no se almacenan en el servidor. Ollama se ejecuta localmente en su máquina.
nl: Documenten worden in het geheugen verwerkt en niet opgeslagen op de server. Ollama draait lokaal op uw machine.

# DocVal.ValidationResults
source: Validation Results
es: Resultados de Validación
nl: Validatieresultaten

# DocVal.DocumentInformation
source: Document Information
es: Información del Documento
nl: Documentinformatie

# DocVal.DocumentType
source: Document Type:
es: Tipo de Documento:

# DocVal.Description
source: Description:
es: Descripción:
nl: Beschrijving:

# DocVal.DocumentNumber
source: Document Number:
es: Número de Documento:
nl: Documentnummer:

# DocVal.ExpirationDate
source: Expiration Date:
es: Fecha de Vencimiento:
nl: Vervaldatum:

# DocVal.IssuingAuthority
source: Issuing Authority:
es: Autoridad Emisora:
nl: Uitgevende autoriteit:

# DocVal.ValidationMessages
source: Validation Messages
es: Mensajes de Validación
nl: Validatieberichten

# DocVal.NoValidationMessages
source: No validation messages.
es: No hay mensajes de validación.
nl: Geen validatieberichten.

# DocVal.ExtractedText
source: Extracted Text
es: Texto Extraído
nl: Geëxtraheerde tekst

# DocVal.ValidationFailed
source: Validation Failed
es: Validación Fallida
nl: Validatie mislukt

# DocVal.FileSizeError
source: File size exceeds the maximum allowed size of 10MB. Your file is {0}MB.
es: El tamaño del archivo excede el tamaño máximo permitido de 10MB. Su archivo es de {0}MB.
nl: Bestandsgrootte overschrijdt de maximaal toegestane grootte van 10MB. Uw bestand is {0}MB.

# DocVal.InvalidFileType
source: Invalid file type. Please upload PDF or image files (PNG, JPG, JPEG).
es: Tipo de archivo no válido. Por favor cargue archivos PDF o de imagen (PNG, JPG, JPEG).
nl: Ongeldig bestandstype. Upload alstublieft PDF- of afbeeldingsbestanden (PNG, JPG, JPEG).

# DocVal.ProcessingError
source: Error processing file: {0}
es: Error al procesar el archivo: {0}
nl: Fout bij het verwerken van bestand: {0}

# DocVal.ShowPreview
source: Show Preview
es: Mostrar Vista Previa

# DocVal.HidePreview
source: Hide Preview
es: Ocultar Vista Previa

# DocVal.ImagePreview
source: Image Preview
es: Vista Previa de Imagen

# Common.Language
source: Language
es: Idioma
nl: Taal
